#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.corp-key: Refreshing state... [id=Corp-key]
aws_vpc.corp-vpc: Refreshing state... [id=vpc-0bf8b28a4e78b8f96]
aws_s3_bucket.gha-bk: Refreshing state... [id=gha-bk]
aws_internet_gateway.gw: Refreshing state... [id=igw-01213b0428c653c26]
aws_subnet.corp-sb: Refreshing state... [id=subnet-08381dda30b571669]
aws_security_group.allow_con: Refreshing state... [id=sg-0a06fb8af98265c4e]
aws_route_table.corp-rt: Refreshing state... [id=rtb-0b7f4fbc72c3be76b]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4: Refreshing state... [id=sgr-0f43db07e4e6e4371]
aws_vpc_security_group_ingress_rule.allow_http_ipv4: Refreshing state... [id=sgr-0254b891fbc24f15f]
aws_vpc_security_group_ingress_rule.allow_ssh_ipv4: Refreshing state... [id=sgr-072679018b0f71434]
aws_instance.corp-webserver: Refreshing state... [id=i-004986ef52468e4ce]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-0e0144124049cada1]
aws_eip.lb: Refreshing state... [id=eipalloc-0c13ac9f2d3617664]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.lb will be updated in-place
  ~ resource "aws_eip" "lb" {
        id                       = "eipalloc-0c13ac9f2d3617664"
      ~ instance                 = "i-004986ef52468e4ce" -> (known after apply)
        tags                     = {}
        # (17 unchanged attributes hidden)
    }

  # aws_instance.corp-webserver must be replaced
-/+ resource "aws_instance" "corp-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:746196583728:instance/i-004986ef52468e4ce" -> (known after apply)
      ~ availability_zone                    = "us-east-1e" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-004986ef52468e4ce" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05e4269a1461d2343" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-109.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.109" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "44.223.218.230" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0a06fb8af98265c4e",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Env"  = "DEV"
            "Name" = "Corp-webserver"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0a06fb8af98265c4e",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0046c75ad98469fef" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket.vka-bk will be created
  + resource "aws_s3_bucket" "vka-bk" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "vka-bk"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "vka-bk"
        }
      + tags_all                    = {
          + "Name" = "vka-bk"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @insiible-techup, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform plan`*